app/views/articles/_tags.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "article_tags" ON "tags"."id" = "article_tags"."tag_id" WHERE "article_tags"."article_id" = ?  [["article_id", 83]]
---
<p>Tags:
    <% @article.tags.each do |tag| %>

SELECT "tags".* FROM "tags"
---
    <%= f.hidden_field :article_id%> <br>
    <%=f.collection_select :tag_id, Tag.all, :id, :name %>