app/views/articles/show.html.erb

<div class="form-group">
    <% @saved_article = current_user.saved_articles.find{ |sa| sa.article == @article} %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "saved_articles".* FROM "saved_articles" WHERE "saved_articles"."user_id" = ?  [["user_id", 1]]