app/views/articles/show.html.erb

SELECT 1 AS one FROM "users" INNER JOIN "saved_articles" ON "users"."id" = "saved_articles"."user_id" WHERE "saved_articles"."article_id" = ? AND "users"."id" = ? LIMIT ?  [["article_id", 6], ["id", 1], ["LIMIT", 1]]
---
</iframe>
<% if !@article.users.include?(current_user) %>

SELECT "saved_articles".* FROM "saved_articles" WHERE "saved_articles"."article_id" = ?  [["article_id", 3]]
---
<ul>
<% @article.saved_articles.each do |sa| %>