app/views/users/profile.html.erb


<% @user.saved_articles.each do |sa| %>
---
SELECT "saved_articles".* FROM "saved_articles" WHERE "saved_articles"."user_id" = ?  [["user_id", 1]]

    Tags:
    <% sa.article.tags.each do |t| %>
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "article_tags" ON "tags"."id" = "article_tags"."tag_id" WHERE "article_tags"."article_id" = ?  [["article_id", 128]]