app/views/users/show.html.erb

<% if @user.saved_articles == [] %>
    <h4> This user has no saved_articles :( </h4>
<%end %>
</div>


<% @user.saved_articles.each do |sa| %>
    <div class="article_list">
            <%= link_to sa.article.title, sa.article %>: <%= sa.article.short_desc %>
    <br> Note: <%= sa.note %>

    <br> Tags:
    <% sa.article.tags.each do |t| %>
        <%= t.name %>
    <% end %>
    </div>
<% end %>
---
SELECT "tags".* FROM "tags" INNER JOIN "article_tags" ON "tags"."id" = "article_tags"."tag_id" WHERE "article_tags"."article_id" = ?  [["article_id", 128]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
SELECT "saved_articles".* FROM "saved_articles" WHERE "saved_articles"."user_id" = ?  [["user_id", 1]]
SELECT "saved_articles".* FROM "saved_articles" WHERE "saved_articles"."user_id" = ?  [["user_id", 9]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 128], ["LIMIT", 1]]