app/controllers/articles_controller.rb

    def index
        if params[:q] && params[:q] != ""
            Article.search(params[:q])
            @articles =  Article.all.select {|article| article.title.downcase.include?(params[:q].downcase)}
        elsif params[:f] && params[:f] != "" && Tag.find_by(name: params[:f])
            @articles = Article.all.select do |article|
                article.tags.include?(Tag.find_by(name: params[:f]))
            end
        elsif params[:p] == ""
                @articles = Article.all.select {|article| article.users != []}
                @articles = @articles.sort{|article| article.users.length }
        elsif params[:t] == ""
            @articles = Article.all.select {|article| article.tags != []}
            @articles = @articles.sort{|article| article.tags.length }.reverse
        else
            @articles = Article.all.sort_by {|article| article.title}
---
SELECT "articles".* FROM "articles"
SELECT "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "cool"], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."title" = ? LIMIT ?  [["title", "Taco"], ["LIMIT", 1]]
SELECT 1 AS one FROM "tags" INNER JOIN "article_tags" ON "tags"."id" = "article_tags"."tag_id" WHERE "article_tags"."article_id" = ? AND "tags"."id" = ? LIMIT ?  [["article_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" INNER JOIN "saved_articles" ON "users"."id" = "saved_articles"."user_id" WHERE "saved_articles"."article_id" = ?  [["article_id", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."title" = ? LIMIT ?  [["title", "Strawberry"], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" INNER JOIN "article_tags" ON "tags"."id" = "article_tags"."tag_id" WHERE "article_tags"."article_id" = ?  [["article_id", 1]]