app/controllers/article_tags_controller.rb

INSERT INTO "article_tags" ("article_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 83], ["tag_id", 5], ["created_at", "2019-12-05 18:37:01.170892"], ["updated_at", "2019-12-05 18:37:01.170892"]]
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sad"], ["created_at", "2019-12-05 18:39:03.070917"], ["updated_at", "2019-12-05 18:39:03.070917"]]
INSERT INTO "article_tags" ("article_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 95], ["tag_id", 7], ["created_at", "2019-12-05 18:39:03.083900"], ["updated_at", "2019-12-05 18:39:03.083900"]]
SELECT "article_tags".* FROM "article_tags" WHERE "article_tags"."tag_id" = ? AND "article_tags"."article_id" = ? LIMIT ?  [["tag_id", 1], ["article_id", 132], ["LIMIT", 1]]
SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 95], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 83], ["LIMIT", 1]]
---
    def create
        if params[:article_tag][:tag][:name] != ""
            @tag = Tag.new(name: params[:article_tag][:tag][:name])
            @article_tag = ArticleTag.new(article_id: params[:article_tag][:article_id])
            if @tag.valid?
                @tag.save
                @article_tag.tag = @tag
                @article_tag.save
                redirect_to Article.find(params[:article_tag][:article_id])
            end
        else
            @article_tag = ArticleTag.create(tag_id: params[:article_tag][:tag_id], article_id: params[:article_tag][:article_id] )
            redirect_to Article.find(params[:article_tag][:article_id])