app/controllers/saved_articles_controller.rb

    def create
        @saved_article = SavedArticle.new(saved_article_params)
        @saved_article.user_id = session[:user_id]
        if @saved_article.valid?
            @saved_article.save
---
INSERT INTO "saved_articles" ("user_id", "article_id", "note", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["article_id", 1], ["note", "I'm learning number theory now\r\n"], ["created_at", "2020-01-17 19:43:33.969723"], ["updated_at", "2020-01-17 19:43:33.969723"]]

    def update
        @saved_article = SavedArticle.find(params[:saved_article][:id])
        if @saved_article.update(saved_article_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 83], ["LIMIT", 1]]
SELECT "saved_articles".* FROM "saved_articles" WHERE "saved_articles"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "saved_articles" SET "note" = ?, "updated_at" = ? WHERE "saved_articles"."id" = ?  [["note", "Very delicious"], ["updated_at", "2019-12-05 18:37:29.523620"], ["id", 18]]

    def destroy
        @saved_article = SavedArticle.find(params[:id])
        @saved_article.destroy
---
SELECT "saved_articles".* FROM "saved_articles" WHERE "saved_articles"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "saved_articles" WHERE "saved_articles"."id" = ?  [["id", 18]]