app/controllers/sessions_controller.rb

    def create
      # byebug
      @user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "dawn"], ["LIMIT", 1]]