app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.valid?
            @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "last_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "will"], ["updated_at", "2019-12-05 18:36:31.319300"], ["id", 1]]
---
    def update
        @user = User.find(params[:id])
        if @user.update(user_params)

DELETE FROM "saved_articles" WHERE "saved_articles"."id" = ?  [["id", 6]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
    def destroy

        current_user.saved_articles.destroy_all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def profile
        @user = User.find(session[:user_id])