app/controllers/users_controller.rb

    def destroy
        User.find(params[:id]).destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]