app/models/article.rb

    def self.search(search)
        response = RestClient.get("https://en.wikipedia.org/w/api.php?action=opensearch&search=#{search}&limit=10&format=json")
        results_hash = JSON.parse(response)
        articles = results_hash[1].map { |title| Article.find_or_create_by(title: title) }
        articles.each_with_index do |article, i|
            article.short_desc = results_hash[2][i]
            article.url = results_hash[3][i]
            article.save
---
INSERT INTO "articles" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Ham"], ["created_at", "2019-12-04 22:35:40.384742"], ["updated_at", "2019-12-04 22:35:40.384742"]]
SELECT "articles".* FROM "articles" WHERE "articles"."title" = ? LIMIT ?  [["title", "Ham"], ["LIMIT", 1]]
UPDATE "articles" SET "url" = ?, "short_desc" = ?, "updated_at" = ? WHERE "articles"."id" = ?